Backend-Performance-Framework/jmeter/plans/sample-store.jmx
<?xml version='1.0' encoding='UTF-8'?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Fictional Sample Store" enabled="true">
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="Variables" enabled="true">
        <collectionProp name="Arguments.arguments" />
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Synthetic users" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(users,1)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(ramp,1)}</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="SETUP | identity" enabled="true">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="filename">${__P(script_dir)}/initialize.groovy</stringProp>
          <stringProp name="cacheKey">true</stringProp>
        </JSR223Sampler>
        <hashTree />
        <LoopController guiclass="LoopControlPanel" testclass="LoopController" testname="Business iterations" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${__P(iterations,1)}</stringProp>
        </LoopController>
        <hashTree>
          <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="SETUP | iteration" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="filename">${__P(script_dir)}/reset.groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
          </JSR223Sampler>
          <hashTree />
          <TransactionController guiclass="TransactionControllerGui" testclass="TransactionController" testname="TXN | ${__P(suite,checkout)}" enabled="true">
            <boolProp name="TransactionController.parent">false</boolProp>
            <boolProp name="TransactionController.includeTimers">false</boolProp>
          </TransactionController>
          <hashTree>
            <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="API | login" enabled="true">
              <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="Arguments" enabled="true">
                <collectionProp name="Arguments.arguments">
                  <elementProp name="" elementType="HTTPArgument">
                    <boolProp name="HTTPArgument.always_encode">false</boolProp>
                    <stringProp name="Argument.value">{"username":"${username}","password":"${password}"}</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                    <boolProp name="HTTPArgument.use_equals">true</boolProp>
                  </elementProp>
                </collectionProp>
              </elementProp>
              <stringProp name="HTTPSampler.domain">${__P(host,127.0.0.1)}</stringProp>
              <stringProp name="HTTPSampler.port">${__P(port,8765)}</stringProp>
              <stringProp name="HTTPSampler.protocol">${__P(protocol,http)}</stringProp>
              <stringProp name="HTTPSampler.path">/api/login</stringProp>
              <stringProp name="HTTPSampler.method">POST</stringProp>
              <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
              <stringProp name="HTTPSampler.connect_timeout">5000</stringProp>
              <stringProp name="HTTPSampler.response_timeout">5000</stringProp>
              <boolProp name="HTTPSampler.follow_redirects">false</boolProp>
              <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
              <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
              <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            </HTTPSamplerProxy>
            <hashTree>
              <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="JSON and authorization" enabled="true">
                <collectionProp name="HeaderManager.headers">
                  <elementProp name="" elementType="Header">
                    <stringProp name="Header.name">Content-Type</stringProp>
                    <stringProp name="Header.value">application/json</stringProp>
                  </elementProp>
                  <elementProp name="" elementType="Header">
                    <stringProp name="Header.name">Authorization</stringProp>
                    <stringProp name="Header.value">Bearer ${token}</stringProp>
                  </elementProp>
                </collectionProp>
              </HeaderManager>
              <hashTree />
              <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Validate contract" enabled="true">
                <stringProp name="scriptLanguage">groovy</stringProp>
                <stringProp name="filename">${__P(script_dir)}/validate.groovy</stringProp>
                <stringProp name="cacheKey">true</stringProp>
              </JSR223PostProcessor>
              <hashTree />
            </hashTree>
            <IfController guiclass="IfControllerGui" testclass="IfController" testname="Catalog suites" enabled="true">
              <stringProp name="IfController.condition">${__groovy(props.get('suite') != 'login')}</stringProp>
              <boolProp name="IfController.evaluateAll">false</boolProp>
              <boolProp name="IfController.useExpression">true</boolProp>
            </IfController>
            <hashTree>
              <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="API | catalog" enabled="true">
                <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="Arguments" enabled="true">
                  <collectionProp name="Arguments.arguments" />
                </elementProp>
                <stringProp name="HTTPSampler.domain">${__P(host,127.0.0.1)}</stringProp>
                <stringProp name="HTTPSampler.port">${__P(port,8765)}</stringProp>
                <stringProp name="HTTPSampler.protocol">${__P(protocol,http)}</stringProp>
                <stringProp name="HTTPSampler.path">/api/products</stringProp>
                <stringProp name="HTTPSampler.method">GET</stringProp>
                <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
                <stringProp name="HTTPSampler.connect_timeout">5000</stringProp>
                <stringProp name="HTTPSampler.response_timeout">5000</stringProp>
                <boolProp name="HTTPSampler.follow_redirects">false</boolProp>
                <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
                <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
                <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
              </HTTPSamplerProxy>
              <hashTree>
                <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="JSON and authorization" enabled="true">
                  <collectionProp name="HeaderManager.headers">
                    <elementProp name="" elementType="Header">
                      <stringProp name="Header.name">Content-Type</stringProp>
                      <stringProp name="Header.value">application/json</stringProp>
                    </elementProp>
                    <elementProp name="" elementType="Header">
                      <stringProp name="Header.name">Authorization</stringProp>
                      <stringProp name="Header.value">Bearer ${token}</stringProp>
                    </elementProp>
                  </collectionProp>
                </HeaderManager>
                <hashTree />
                <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Validate contract" enabled="true">
                  <stringProp name="scriptLanguage">groovy</stringProp>
                  <stringProp name="filename">${__P(script_dir)}/validate.groovy</stringProp>
                  <stringProp name="cacheKey">true</stringProp>
                </JSR223PostProcessor>
                <hashTree />
              </hashTree>
            </hashTree>
            <IfController guiclass="IfControllerGui" testclass="IfController" testname="Checkout suite" enabled="true">
              <stringProp name="IfController.condition">${__groovy(props.get('suite') == 'checkout')}</stringProp>
              <boolProp name="IfController.evaluateAll">false</boolProp>
              <boolProp name="IfController.useExpression">true</boolProp>
            </IfController>
            <hashTree>
              <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="API | create-order" enabled="true">
                <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="Arguments" enabled="true">
                  <collectionProp name="Arguments.arguments">
                    <elementProp name="" elementType="HTTPArgument">
                      <boolProp name="HTTPArgument.always_encode">false</boolProp>
                      <stringProp name="Argument.value">{"sku":"notebook","quantity":2}</stringProp>
                      <stringProp name="Argument.metadata">=</stringProp>
                      <boolProp name="HTTPArgument.use_equals">true</boolProp>
                    </elementProp>
                  </collectionProp>
                </elementProp>
                <stringProp name="HTTPSampler.domain">${__P(host,127.0.0.1)}</stringProp>
                <stringProp name="HTTPSampler.port">${__P(port,8765)}</stringProp>
                <stringProp name="HTTPSampler.protocol">${__P(protocol,http)}</stringProp>
                <stringProp name="HTTPSampler.path">/api/orders</stringProp>
                <stringProp name="HTTPSampler.method">POST</stringProp>
                <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
                <stringProp name="HTTPSampler.connect_timeout">5000</stringProp>
                <stringProp name="HTTPSampler.response_timeout">5000</stringProp>
                <boolProp name="HTTPSampler.follow_redirects">false</boolProp>
                <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
                <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
                <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
              </HTTPSamplerProxy>
              <hashTree>
                <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="JSON and authorization" enabled="true">
                  <collectionProp name="HeaderManager.headers">
                    <elementProp name="" elementType="Header">
                      <stringProp name="Header.name">Content-Type</stringProp>
                      <stringProp name="Header.value">application/json</stringProp>
                    </elementProp>
                    <elementProp name="" elementType="Header">
                      <stringProp name="Header.name">Authorization</stringProp>
                      <stringProp name="Header.value">Bearer ${token}</stringProp>
                    </elementProp>
                  </collectionProp>
                </HeaderManager>
                <hashTree />
                <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Validate contract" enabled="true">
                  <stringProp name="scriptLanguage">groovy</stringProp>
                  <stringProp name="filename">${__P(script_dir)}/validate.groovy</stringProp>
                  <stringProp name="cacheKey">true</stringProp>
                </JSR223PostProcessor>
                <hashTree />
              </hashTree>
              <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="API | read-order" enabled="true">
                <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="Arguments" enabled="true">
                  <collectionProp name="Arguments.arguments" />
                </elementProp>
                <stringProp name="HTTPSampler.domain">${__P(host,127.0.0.1)}</stringProp>
                <stringProp name="HTTPSampler.port">${__P(port,8765)}</stringProp>
                <stringProp name="HTTPSampler.protocol">${__P(protocol,http)}</stringProp>
                <stringProp name="HTTPSampler.path">/api/orders/${order_id}</stringProp>
                <stringProp name="HTTPSampler.method">GET</stringProp>
                <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
                <stringProp name="HTTPSampler.connect_timeout">5000</stringProp>
                <stringProp name="HTTPSampler.response_timeout">5000</stringProp>
                <boolProp name="HTTPSampler.follow_redirects">false</boolProp>
                <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
                <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
                <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
              </HTTPSamplerProxy>
              <hashTree>
                <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="JSON and authorization" enabled="true">
                  <collectionProp name="HeaderManager.headers">
                    <elementProp name="" elementType="Header">
                      <stringProp name="Header.name">Content-Type</stringProp>
                      <stringProp name="Header.value">application/json</stringProp>
                    </elementProp>
                    <elementProp name="" elementType="Header">
                      <stringProp name="Header.name">Authorization</stringProp>
                      <stringProp name="Header.value">Bearer ${token}</stringProp>
                    </elementProp>
                  </collectionProp>
                </HeaderManager>
                <hashTree />
                <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Validate contract" enabled="true">
                  <stringProp name="scriptLanguage">groovy</stringProp>
                  <stringProp name="filename">${__P(script_dir)}/validate.groovy</stringProp>
                  <stringProp name="cacheKey">true</stringProp>
                </JSR223PostProcessor>
                <hashTree />
              </hashTree>
            </hashTree>
          </hashTree>
          <IfController guiclass="IfControllerGui" testclass="IfController" testname="Delete owned order" enabled="true">
            <stringProp name="IfController.condition">${__groovy(vars.get('token') &amp;&amp; vars.get('order_id'))}</stringProp>
            <boolProp name="IfController.evaluateAll">false</boolProp>
            <boolProp name="IfController.useExpression">true</boolProp>
          </IfController>
          <hashTree>
            <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="CLEANUP | order" enabled="true">
              <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="Arguments" enabled="true">
                <collectionProp name="Arguments.arguments" />
              </elementProp>
              <stringProp name="HTTPSampler.domain">${__P(host,127.0.0.1)}</stringProp>
              <stringProp name="HTTPSampler.port">${__P(port,8765)}</stringProp>
              <stringProp name="HTTPSampler.protocol">${__P(protocol,http)}</stringProp>
              <stringProp name="HTTPSampler.path">/api/orders/${order_id}</stringProp>
              <stringProp name="HTTPSampler.method">DELETE</stringProp>
              <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
              <stringProp name="HTTPSampler.connect_timeout">5000</stringProp>
              <stringProp name="HTTPSampler.response_timeout">5000</stringProp>
              <boolProp name="HTTPSampler.follow_redirects">false</boolProp>
              <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
              <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
              <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
            </HTTPSamplerProxy>
            <hashTree>
              <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="JSON and authorization" enabled="true">
                <collectionProp name="HeaderManager.headers">
                  <elementProp name="" elementType="Header">
                    <stringProp name="Header.name">Content-Type</stringProp>
                    <stringProp name="Header.value">application/json</stringProp>
                  </elementProp>
                  <elementProp name="" elementType="Header">
                    <stringProp name="Header.name">Authorization</stringProp>
                    <stringProp name="Header.value">Bearer ${token}</stringProp>
                  </elementProp>
                </collectionProp>
              </HeaderManager>
              <hashTree />
              <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Validate contract" enabled="true">
                <stringProp name="scriptLanguage">groovy</stringProp>
                <stringProp name="filename">${__P(script_dir)}/validate.groovy</stringProp>
                <stringProp name="cacheKey">true</stringProp>
              </JSR223PostProcessor>
              <hashTree />
            </hashTree>
          </hashTree>
          <IfController guiclass="IfControllerGui" testclass="IfController" testname="Invalidate session" enabled="true">
            <stringProp name="IfController.condition">${__groovy(!vars.get('token').isEmpty())}</stringProp>
            <boolProp name="IfController.evaluateAll">false</boolProp>
            <boolProp name="IfController.useExpression">true</boolProp>
          </IfController>
          <hashTree>
            <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="CLEANUP | session" enabled="true">
              <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="Arguments" enabled="true">
                <collectionProp name="Arguments.arguments">
                  <elementProp name="" elementType="HTTPArgument">
                    <boolProp name="HTTPArgument.always_encode">false</boolProp>
                    <stringProp name="Argument.value">{}</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                    <boolProp name="HTTPArgument.use_equals">true</boolProp>
                  </elementProp>
                </collectionProp>
              </elementProp>
              <stringProp name="HTTPSampler.domain">${__P(host,127.0.0.1)}</stringProp>
              <stringProp name="HTTPSampler.port">${__P(port,8765)}</stringProp>
              <stringProp name="HTTPSampler.protocol">${__P(protocol,http)}</stringProp>
              <stringProp name="HTTPSampler.path">/api/logout</stringProp>
              <stringProp name="HTTPSampler.method">POST</stringProp>
              <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
              <stringProp name="HTTPSampler.connect_timeout">5000</stringProp>
              <stringProp name="HTTPSampler.response_timeout">5000</stringProp>
              <boolProp name="HTTPSampler.follow_redirects">false</boolProp>
              <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
              <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
              <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            </HTTPSamplerProxy>
            <hashTree>
              <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="JSON and authorization" enabled="true">
                <collectionProp name="HeaderManager.headers">
                  <elementProp name="" elementType="Header">
                    <stringProp name="Header.name">Content-Type</stringProp>
                    <stringProp name="Header.value">application/json</stringProp>
                  </elementProp>
                  <elementProp name="" elementType="Header">
                    <stringProp name="Header.name">Authorization</stringProp>
                    <stringProp name="Header.value">Bearer ${token}</stringProp>
                  </elementProp>
                </collectionProp>
              </HeaderManager>
              <hashTree />
              <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Validate contract" enabled="true">
                <stringProp name="scriptLanguage">groovy</stringProp>
                <stringProp name="filename">${__P(script_dir)}/validate.groovy</stringProp>
                <stringProp name="cacheKey">true</stringProp>
              </JSR223PostProcessor>
              <hashTree />
            </hashTree>
          </hashTree>
          <TestAction guiclass="TestActionGui" testclass="TestAction" testname="Pacing" enabled="true">
            <intProp name="ActionProcessor.action">1</intProp>
            <intProp name="ActionProcessor.target">0</intProp>
            <stringProp name="ActionProcessor.duration">250</stringProp>
          </TestAction>
          <hashTree />
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>